from ship import Корабель
from port import Порт
from containers import *

import json

with open('input.json') as файл:
    дані = json.load(файл)

кораблі = []
порти = []
контейнери = []

# Отримання всіх даних
for елемент in дані:
    тимчасовий_порт = Порт(елемент['широта'], елемент['довгота'])
    порти.append(тимчасовий_порт)
    # Отримання кораблів
    for корабель_елемент in елемент['кораблі']:
        корабель = Корабель(
            тимчасовий_порт,
            КонфігураціяКорабля(
                корабель_елемент['загальна_вага_вантажу'],
                корабель_елемент['максимальна_кількість_всіх_контейнерів'],
                корабель_елемент['максимальна_кількість_звичайних_контейнерів'],
                корабель_елемент['максимальна_кількість_важких_контейнерів'],
                корабель_елемент['максимальна_кількість_рефрижераторних_контейнерів'],
                корабель_елемент['максимальна_кількість_рідких_контейнерів'],
                корабель_елемент['споживання_пального_на_км']
            ),
            корабель_елемент['пальне']
        )
        тимчасовий_порт.поточні_кораблі.append(корабель)
        кораблі.append(корабель)
    # Отримання контейнерів
    for контейнер_елемент in елемент['контейнери']:
        контейнер = None
        if контейнер_елемент['тип_контейнера'] == 'Звичайний':
            контейнер = ЗвичайнийКонтейнер(контейнер_елемент['вага'])
        elif контейнер_елемент['тип_контейнера'] == 'Важкий':
            контейнер = ВажкийКонтейнер(контейнер_елемент['вага'])
        elif контейнер_елемент['тип_контейнера'] == 'Рефрижераторний':
            контейнер = РефрижераторнийКонтейнер(контейнер_елемент['вага'])
        elif контейнер_елемент['тип_контейнера'] == 'Рідкий':
            контейнер = РідкийКонтейнер(контейнер_елемент['вага'])
        else:
            print('!-Ви ввели неправильне значення для типу контейнера-!')
        тимчасовий_порт.контейнери.append(контейнер)
        контейнери.append(контейнер)

кораблі[0].вирушити_до(порти[1])
print()
кораблі[0].вирушити_до(порти[0])
кораблі[0].заправити_пальне(100000)
print()
кораблі[0].вирушити_до(порти[0])
print()


print('Контейнер для завантаження: ', контейнери[0])
print('Контейнери в порту: ', len(порти[0].контейнери))
print('Контейнери на кораблі: ', кораблі[0].контейнери, '\n')

кораблі[0].завантажити(контейнери[0])
print('Контейнери в порту: ', len(порти[0].контейнери))
print('Контейнери на кораблі: ', кораблі[0].контейнери, '\n')

кораблі[0].розвантажити(контейнери[0])
print('Контейнери в порту: ', len(порти[0].контейнери))
print('Контейнери на кораблі: ', кораблі[0].контейнери, '\n')
